#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.main.archive_file.lambda_function: Refreshing state... [id=966380112fc320910fd80bf456aff3d9a512764d]
module.main.aws_ssm_parameter.twitter_api_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiSecret]
module.main.aws_scheduler_schedule_group.group: Refreshing state... [id=lapwing-item-news-dev-scheduler-group]
module.main.aws_ssm_parameter.twitter_access_token: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessToken]
module.main.aws_ssm_parameter.twitter_access_token_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessTokenSecret]
module.main.aws_iam_role.scheduler_role: Refreshing state... [id=lapwing-item-news-dev-scheduler-role]
module.main.aws_iam_role.lambda_role: Refreshing state... [id=lapwing-item-news-dev-lambda-role]
module.main.aws_ssm_parameter.twitter_api_key: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiKey]
module.main.aws_s3_bucket.bucket: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]
module.main.aws_iam_role_policy_attachment.lambda: Refreshing state... [id=lapwing-item-news-dev-lambda-role/arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.main.aws_iam_policy.scheduler_policy will be created
  + resource "aws_iam_policy" "scheduler_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lapwing-item-news-dev-scheduler-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
    }

  # module.main.aws_iam_role_policy_attachment.scheduler will be created
  + resource "aws_iam_role_policy_attachment" "scheduler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lapwing-item-news-dev-scheduler-role"
    }

  # module.main.aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "/home/runner/work/lapwing-item-news/lapwing-item-news/dist/index.zip"
      + function_name                  = "lapwing-item-news-dev-lambda"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::087164360110:role/lapwing-item-news-dev-lambda-role"
      + runtime                        = "nodejs22.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "+8/Y2FWe5Ijc9tQBE/oWl8EcU8Kfm7ZUD7Adw4EJSvM="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
      + timeout                        = 20
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.main.aws_scheduler_schedule.invoke_lambda will be created
  + resource "aws_scheduler_schedule" "invoke_lambda" {
      + action_after_completion      = (known after apply)
      + arn                          = (known after apply)
      + group_name                   = "lapwing-item-news-dev-scheduler-group"
      + id                           = (known after apply)
      + name                         = "lapwing-item-news-dev-scheduler"
      + name_prefix                  = (known after apply)
      + region                       = "ap-northeast-1"
      + schedule_expression          = "cron(0/10 * * * ? *)"
      + schedule_expression_timezone = "Asia/Tokyo"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = (known after apply)
          + role_arn = "arn:aws:iam::087164360110:role/lapwing-item-news-dev-scheduler-role"

          + retry_policy {
              + maximum_event_age_in_seconds = 86400
              + maximum_retry_attempts       = 0
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: `HiroM320`, Stage: `dev`*

If you want to deploy this, please comment `/deploy 18236105058` on this PR.